my_tuple = (10, 20, 30, 40, 50)
print(my_tuple[0], my_tuple[1])


numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
count_23 = numbers.count(23)
print(count_23)


aura = (10, 25, 5, 80, 70, 20)
for number in aura:
    if number > 10:
        print(number)




#    List არის ცვლადი რაც ნიშნავს, რომ მასში ელემენტები შეგვიძლია დავამატოთ, წავშალოთ  შევცვალოთ.
#Tuple არ არის ცვლადი, რაც ნიშნავს, რომ მასში ერთხელ დამატებული ელემენტები ვერ წაიშლება დაემატება ან შეიცვლება.

# List გამოიყენება მაშინროცა მონაცემები უნდა შეიცვალოს ან დაემატოს ან წაიშალოს.
# Tuple გამოიყენება მაშინ როცა მონაცემები უცვლელი უნდა იყოს.
# List: შექმნისთვის გამოიყენება [ ] საჭიროა და Tuple ( ) ჩეულებრივი 




